painnick/RCTank1_ESP32/src/main.cpp
#include <Arduino.h>
#include <Bluepad32.h>
#include <DFPlayerMini_Fast.h>
#include <EEPROM.h>
#include <ESP32Servo.h>
#include <driver/mcpwm.h>
#include <esp_log.h>

#ifdef DISABLE_BROWNOUT_DETECTOR
#include <driver/rtc_io.h>
#include <soc/rtc_cntl_reg.h>
#endif

static auto MAIN_TAG = "RC_TANK";

// 핀 정의
#define DFPLAYER_RX 32
#define DFPLAYER_TX 33
#define LEFT_TRACK_IN1 25
#define LEFT_TRACK_IN2 26
#define RIGHT_TRACK_IN1 27
#define RIGHT_TRACK_IN2 13
#define TURRET_IN1 22
#define TURRET_IN2 21
#define CANNON_LED_PIN 4
#define HEADLIGHT_PIN 16
#define CANNON_MOUNT_SERVO_PIN 19  // 포 마운트 서보 모터 핀 (우측 Y축으로 각도 조절)
#define CANNON_SERVO_PIN 18        // 포신 서보 모터 핀 (A 버튼으로 당기기)

// MCPWM 설정 (모든 모터는 MCPWM_UNIT_0 사용)
#define MCPWM_UNIT MCPWM_UNIT_0
#define LEFT_TRACK_TIMER MCPWM_TIMER_0
#define RIGHT_TRACK_TIMER MCPWM_TIMER_1
#define TURRET_TIMER MCPWM_TIMER_2

// 스틱 데드존(-511~512)
#define STICK_INPUT_MIN (-511)
#define STICK_INPUT_MAX 512
#define STICK_DEAD_ZONE 80

// 모터 듀티(0~100) 데드존
#define MOTOR_DUTY_MIN 0
#define MOTOR_DUTY_MAX 100
#define MOTOR_DEAD_ZONE 70
constexpr int MOTOR_ACTIVE_DUTY = 100 - MOTOR_DEAD_ZONE;
constexpr int SOFT_START_STEP = 4;  // 10ms마다 4씩 증가(1~100)

// Kickstart 설정 (정지 상태에서 출발 시)
constexpr int KICKSTART_DUTY = 80;
constexpr unsigned long KICKSTART_DURATION = 200;  // 200ms

// 헤드라이트 PWM 설정
#define HEADLIGHT_PWM_CHANNEL 5
#define HEADLIGHT_PWM_FREQ 5000
#define HEADLIGHT_PWM_RESOLUTION 8
#define HEADLIGHT_DUTY_ON 128  // 50% 밝기 (255의 절반)
#define HEADLIGHT_DUTY_OFF 0
#define HEADLIGHT_DUTY_MIN 8
#define HEADLIGHT_DUTY_MAX 255
#define HEADLIGHT_DUTY_STEP 16

// 모터 설정 구조체
typedef struct {
  int in1Pin;
  int in2Pin;
  mcpwm_unit_t unit;
  mcpwm_timer_t timer;
  int* currentSpeed;  // prevSpeed를 currentSpeed로 의미 변경
} MotorConfig;

// EEPROM 주소

#define EEPROM_VOLUME_ADDR 4

// EEPROM 초기화 플래그
#define EEPROM_INIT_FLAG_ADDR 5

// 게임패드 관련 변수
ControllerPtr myControllers[BP32_MAX_GAMEPADS];
bool gamepadConnected = false;

// DFPlayer 관련 변수
DFPlayerMini_Fast myDFPlayer;
HardwareSerial DFPlayerSerial(2);  // UART2 사용
unsigned long lastIdleSoundTime = 0;
constexpr unsigned long idleSoundInterval = 13000;  // 13초마다 효과음 1 재생

// 서보 모터 객체
Servo cannonMountServo;  // 포 마운트 서보 모터
Servo cannonServo;       // 포신 서보 모터

// 모터 제어 변수

int leftTrackPWM = 0;          // 현재 적용된 PWM (Soft Start 적용됨)
int rightTrackPWM = 0;         // 현재 적용된 PWM
int targetLeftTrackDuty = 0;   // 목표 PWM
int targetRightTrackDuty = 0;  // 목표 PWM

int turretPWM = 0;
int cannonMountAngle = 90;       // 포 마운트 기본 각도 (중앙)
constexpr int cannonAngle = 90;  // 포신 기본 각도 (중앙)

// 볼륨 제어 변수
int currentVolume = 20;      // 현재 볼륨 (1-30)
int tempVolume = 20;         // 임시 볼륨 (버튼을 누르고 있는 동안 사용)
bool volumeChanged = false;  // 볼륨이 변경되었는지 확인

// DC 모터 현재 속도 값 저장 변수 (prev -> current)
int currentLeftTrackSpeed = 0;
int currentRightTrackSpeed = 0;
int prevTurretSpeed = 0;

// Kickstart 상태 변수
bool leftKickstartActive = false;
unsigned long leftKickstartEndTime = 0;
bool rightKickstartActive = false;
unsigned long rightKickstartEndTime = 0;

// 모터 설정 구조체 인스턴스
MotorConfig leftTrackMotor = {.in1Pin = LEFT_TRACK_IN1,
                              .in2Pin = LEFT_TRACK_IN2,
                              .unit = MCPWM_UNIT,
                              .timer = LEFT_TRACK_TIMER,
                              .currentSpeed = &currentLeftTrackSpeed};

MotorConfig rightTrackMotor = {.in1Pin = RIGHT_TRACK_IN1,
                               .in2Pin = RIGHT_TRACK_IN2,
                               .unit = MCPWM_UNIT,
                               .timer = RIGHT_TRACK_TIMER,
                               .currentSpeed = &currentRightTrackSpeed};

MotorConfig turretMotor = {.in1Pin = TURRET_IN1,
                           .in2Pin = TURRET_IN2,
                           .unit = MCPWM_UNIT,
                           .timer = TURRET_TIMER,
                           .currentSpeed = &prevTurretSpeed};  // 터렛은 Soft Start 미적용으로 prev 유지

// LED 상태
bool headlightOn = false;
int headlightDuty = 0;  // 현재 헤드라이트 밝기 (0~255)
unsigned long lastBlinkTime = 0;
constexpr unsigned long blinkInterval = 100;  // 100ms 간격으로 깜빡임

// 포신 발사 관련 변수
bool cannonFiring = false;
unsigned long cannonStartTime = 0;
constexpr unsigned long cannonDuration = 1500;    // 1초 동안 포신 당김 (재발사 방지 쿨타임 역할)
constexpr unsigned long cannonLedDuration = 200;  // LED는 200ms만 켜짐

// 기관총 발사 관련 변수
bool machineGunFiring = false;
unsigned long machineGunStartTime = 0;
constexpr unsigned long machineGunDuration = 600;  // 1초간 기관총 발사

// 효과음 파일 번호
#define SOUND_IDLE 1
#define SOUND_CANNON 2
#define SOUND_MACHINEGUN 3
#define SOUND_CONNECTED 4

// 게임패드 연결 콜백
void onConnectedController(ControllerPtr ctl) {
  bool foundEmptySlot = false;
  for (int i = 0; i < BP32_MAX_GAMEPADS; i++) {
    if (myControllers[i] == nullptr) {
      ESP_LOGI(MAIN_TAG, "Gamepad connected, index=%d", i);
      const ControllerProperties properties = ctl->getProperties();
      ESP_LOGI(MAIN_TAG, "Controller model: %s, VID=0x%04x, PID=0x%04x",
               ctl->getModelName().c_str(),
               properties.vendor_id,
               properties.product_id);
      myControllers[i] = ctl;
      foundEmptySlot = true;
      gamepadConnected = true;

      // 게임패드 연결 시 효과음 4 재생
      myDFPlayer.play(SOUND_CONNECTED);
      break;
    }
  }
  if (!foundEmptySlot) {
    ESP_LOGW(MAIN_TAG, "Gamepad connected, but no empty slot found");
  }
}

// 게임패드 연결 해제 콜백
void onDisconnectedController(ControllerPtr ctl) {
  bool foundController = false;
  for (int i = 0; i < BP32_MAX_GAMEPADS; i++) {
    if (myControllers[i] == ctl) {
      ESP_LOGI(MAIN_TAG, "Gamepad disconnected, index=%d", i);
      myControllers[i] = nullptr;
      foundController = true;
      break;
    }
  }

  // 모든 게임패드가 연결 해제되었는지 확인
  gamepadConnected = false;
  for (const auto& myController : myControllers) {
    if (myController != nullptr) {
      gamepadConnected = true;
      break;
    }
  }

  if (!gamepadConnected) {
    // 모든 게임패드가 연결 해제되면 효과음 1 재생 시작
    myDFPlayer.play(SOUND_IDLE);
    lastIdleSoundTime = millis();
  }

  if (!foundController) {
    ESP_LOGW(MAIN_TAG, "Gamepad disconnected, but not found in myControllers");
  }
}

// 스틱 입력값을 PWM 듀티로 변환하는 함수
int calculateMotorDuty(const int stick) {
  int duty = 0;
  const int absStick = abs(stick);
  if (absStick < STICK_DEAD_ZONE) {
    duty = 0;
  } else if (absStick > 500) {
    duty = stick > 0 ? MOTOR_DUTY_MAX : -MOTOR_DUTY_MAX;
  } else {
    const auto sanitizedStick = stick - STICK_DEAD_ZONE;
    duty = map(sanitizedStick,
               STICK_INPUT_MIN + STICK_DEAD_ZONE,
               STICK_INPUT_MAX - STICK_DEAD_ZONE,
               MOTOR_ACTIVE_DUTY * -1,
               MOTOR_ACTIVE_DUTY);
    if (duty > 0)
      duty += MOTOR_ACTIVE_DUTY;
    else
      duty -= MOTOR_ACTIVE_DUTY;
  }
  return duty;
}

// PWM을 모터에 적용하는 함수 (이전 setMotorSpeed의 하드웨어 제어 부분)
void applyMotorPWM(const MotorConfig* motor, int duty) {
  if (abs(duty) < MOTOR_DEAD_ZONE) {
    duty = 0;
  }

  // 속도 변화가 없으면 호출 무시
  if (duty == *(motor->currentSpeed)) {
    return;
  }

