painnick/RCTank1_ESP32/src/main.cpp
  ESP_LOGD(MAIN_TAG,
           "applyMotorPWM IN1:%d IN2:%d Unit:%d Timer:%d Duty:%3d (prev:%d)",
           motor->in1Pin, motor->in2Pin, motor->unit, motor->timer, duty, *(motor->currentSpeed));

  if (duty > 0) {
    // 정방향 회전
    mcpwm_set_duty(motor->unit, motor->timer, MCPWM_OPR_A, static_cast<float>(duty));
    mcpwm_set_duty(motor->unit, motor->timer, MCPWM_OPR_B, 0);
  } else if (duty < 0) {
    // 역방향 회전
    mcpwm_set_duty(motor->unit, motor->timer, MCPWM_OPR_A, 0);
    mcpwm_set_duty(motor->unit, motor->timer, MCPWM_OPR_B, static_cast<float>(-duty));
  } else {
    // 정지
    mcpwm_set_duty(motor->unit, motor->timer, MCPWM_OPR_A, 0);
    mcpwm_set_duty(motor->unit, motor->timer, MCPWM_OPR_B, 0);
  }

  // 현재 속도를 저장
  *(motor->currentSpeed) = duty;
}

// Soft Start 처리 함수
void processSoftStart() {
  const unsigned long currentTime = millis();

  // --------------------------------------------------------
  // 좌측 트랙 처리
  // --------------------------------------------------------
  // Kickstart 시작 조건 확인: 현재 정지(0) 상태이고 목표가 0이 아닐 때
  if (leftTrackPWM == 0 && targetLeftTrackDuty != 0 && !leftKickstartActive) {
    leftKickstartActive = true;
    leftKickstartEndTime = currentTime + KICKSTART_DURATION;
  }

  // Kickstart 취소 및 종료 조건
  if (leftKickstartActive) {
    if (targetLeftTrackDuty == 0) {
      // 목표가 0이 되면 즉시 Kickstart 중지 (Soft Stop으로 전환)
      leftKickstartActive = false;
    } else if (currentTime > leftKickstartEndTime) {
      // 시간 초과 시 Kickstart 종료 (Soft Start ramping으로 이어짐)
      leftKickstartActive = false;
    }
  }

  if (leftKickstartActive) {
    // Kickstart 적용 (목표 방향에 따라 76 or -76)
    leftTrackPWM = (targetLeftTrackDuty > 0) ? KICKSTART_DUTY : -KICKSTART_DUTY;
  } else {
    // 일반 Soft Start (Ramping)
    if (leftTrackPWM < targetLeftTrackDuty) {
      leftTrackPWM += SOFT_START_STEP;
      if (leftTrackPWM > targetLeftTrackDuty) leftTrackPWM = targetLeftTrackDuty;
    } else if (leftTrackPWM > targetLeftTrackDuty) {
      leftTrackPWM -= SOFT_START_STEP;
      if (leftTrackPWM < targetLeftTrackDuty) leftTrackPWM = targetLeftTrackDuty;
    }
  }
  applyMotorPWM(&leftTrackMotor, leftTrackPWM);

  // --------------------------------------------------------
  // 우측 트랙 처리
  // --------------------------------------------------------
  if (rightTrackPWM == 0 && targetRightTrackDuty != 0 && !rightKickstartActive) {
    rightKickstartActive = true;
    rightKickstartEndTime = currentTime + KICKSTART_DURATION;
  }

  if (rightKickstartActive) {
    if (targetRightTrackDuty == 0) {
      rightKickstartActive = false;
    } else if (currentTime > rightKickstartEndTime) {
      rightKickstartActive = false;
    }
  }

  if (rightKickstartActive) {
    rightTrackPWM = (targetRightTrackDuty > 0) ? KICKSTART_DUTY : -KICKSTART_DUTY;
  } else {
    if (rightTrackPWM < targetRightTrackDuty) {
      rightTrackPWM += SOFT_START_STEP;
      if (rightTrackPWM > targetRightTrackDuty) rightTrackPWM = targetRightTrackDuty;
    } else if (rightTrackPWM > targetRightTrackDuty) {
      rightTrackPWM -= SOFT_START_STEP;
      if (rightTrackPWM < targetRightTrackDuty) rightTrackPWM = targetRightTrackDuty;
    }
  }
  applyMotorPWM(&rightTrackMotor, rightTrackPWM);
}

// 포 마운트 서보 모터 제어 함수
void setCannonMountAngle(const int angle) {
  ESP_LOGD(MAIN_TAG, "Cannon-Mount Angle %3d degree", angle);
  cannonMountServo.write(angle);
}

// 포신 서보 모터 제어 함수
void setCannonAngle(const int angle) {
  ESP_LOGD(MAIN_TAG, "Cannon Angle %3d degree", angle);
  cannonServo.write(angle);
}

// 볼륨 설정 저장
void saveVolumeSettings() {
  EEPROM.write(EEPROM_VOLUME_ADDR, currentVolume);
  EEPROM.commit();
  ESP_LOGI(MAIN_TAG, "Volume setting saved: %d", currentVolume);
}

// 볼륨 설정 로드
void loadVolumeSettings() {
  int volume = EEPROM.read(EEPROM_VOLUME_ADDR);

  // 기본값 설정 (EEPROM이 초기화되지 않은 경우)
  if (volume < 10 || volume > 30) {
    volume = 20;  // 기본 볼륨 20
    EEPROM.write(EEPROM_VOLUME_ADDR, volume);
    EEPROM.commit();
  }

  currentVolume = volume;
  tempVolume = volume;
  myDFPlayer.volume(currentVolume);
  ESP_LOGI(MAIN_TAG, "Volume setting loaded: %d", currentVolume);
}

// EEPROM 초기화 및 ESP32 재시작
void resetEEPROMAndRestart() {
  ESP_LOGI(MAIN_TAG, "EEPROM 초기화 및 재시작 시작...");

  // 모든 EEPROM 데이터 초기화
  for (int i = 0; i < 512; i++) {
    EEPROM.write(i, 0);
  }
  EEPROM.commit();

  ESP_LOGI(MAIN_TAG, "EEPROM 초기화 완료. 3초 후 재시작합니다.");

  // 3초 대기 후 재시작
  delay(3000);
  esp_restart();
}

void dumpGamepad(ControllerPtr ctl) {
  // clang-format off
  ESP_LOGV(MAIN_TAG,
           "0x%02x %s %s %s %s %s %s %s %s %s %s %s %s %s %s misc: 0x%02x LY:%3d RY:%3d",
           ctl->dpad(),
           ctl->a() ? "A" : "-",
           ctl->b() ? "B" : "-",
           ctl->x() ? "X" : "-",
           ctl->y() ? "Y" : "-",
           ctl->l1() ? "L1" : "--",
           ctl->r1() ? "R1" : "--",
           ctl->l2() ? "L2" : "--",
           ctl->r2() ? "R2" : "--",
           ctl->thumbL() ? "ThumbL" : "------",
           ctl->thumbR() ? "ThumbR" : "------",
           ctl->miscStart() ? "Start" : "------",
           ctl->miscSelect() ? "Select" : "------",
           ctl->miscSystem() ? "System" : "------",
           ctl->miscCapture() ? "Capture" : "------",
           ctl->miscButtons(),
           ctl->axisY(),
           ctl->axisRY());
  // clang-format on
}

// 게임패드 처리 함수
void processGamepad(ControllerPtr ctl) {
  dumpGamepad(ctl);

  // 좌측 스틱 Y축으로 좌측 트랙 제어, 우측 스틱 Y축으로 우측 트랙 제어

  // 모터 제어
  // 모터 제어 (Target 설정)
  targetLeftTrackDuty = calculateMotorDuty(ctl->axisY());
  targetRightTrackDuty = calculateMotorDuty(ctl->axisRY());

  // D-PAD로 터렛과 포 마운트 제어
  // D-PAD 좌우로 터렛 제어
  int turretSpeed = 0;
  if (ctl->dpad() == DPAD_LEFT) {
    turretSpeed = STICK_INPUT_MIN;  // 좌측 회전
  } else if (ctl->dpad() == DPAD_RIGHT) {
    turretSpeed = STICK_INPUT_MAX;  // 우측 회전
  }
  int turretDuty = calculateMotorDuty(turretSpeed);
  applyMotorPWM(&turretMotor, turretDuty);

  // D-PAD 상하로 포 마운트 각도 제어
  if (ctl->dpad() == DPAD_UP) {
    cannonMountAngle = constrain(cannonMountAngle + 2, 75, 160);  // 위로 올림
    setCannonMountAngle(cannonMountAngle);
  } else if (ctl->dpad() == DPAD_DOWN) {
    cannonMountAngle = constrain(cannonMountAngle - 2, 75, 160);  // 아래로 내림
    setCannonMountAngle(cannonMountAngle);
  }

  // B 버튼으로 포신 발사
  if (ctl->b() && !cannonFiring && !machineGunFiring) {
    cannonFiring = true;
    cannonStartTime = millis();
    // 포신 발사 중에는 LED를 지속 점등
    digitalWrite(CANNON_LED_PIN, HIGH);

    // 효과음 2 재생
    myDFPlayer.play(SOUND_CANNON);

