painnick/RCTank1_ESP32/src/main.cpp
    // 게임 패드 진동
    ctl->playDualRumble(0, 400, 0xFF, 0x0);

    // cannonServo.attach(CANNON_SERVO_PIN);  // 포신 서보 모터
    delay(100);
    // 포신 당기기
    setCannonAngle(cannonAngle - 90);  // 포신을 아래로 당김

    delay(100);

    digitalWrite(CANNON_LED_PIN, LOW);

    delay(100);

    // recoil: Soft Start bypass (즉시 적용)
    constexpr int recoilDuty = 70;
    leftTrackPWM = recoilDuty;
    rightTrackPWM = recoilDuty;
    targetLeftTrackDuty = recoilDuty;
    targetRightTrackDuty = recoilDuty;
    applyMotorPWM(&leftTrackMotor, leftTrackPWM);
    applyMotorPWM(&rightTrackMotor, rightTrackPWM);

    delay(100);

    // Stop (즉시 적용)
    leftTrackPWM = 0;
    rightTrackPWM = 0;
    targetLeftTrackDuty = 0;
    targetRightTrackDuty = 0;
    applyMotorPWM(&leftTrackMotor, 0);
    applyMotorPWM(&rightTrackMotor, 0);

    setCannonAngle(cannonAngle);  // 포신을 원래 위치로 복원

    delay(300);
    // cannonServo.detach();  // 포신 서보 모터
    // delay(100);
  }

  // A 버튼으로 기관총 발사
  if (ctl->a() && !machineGunFiring && !cannonFiring) {
    machineGunFiring = true;
    machineGunStartTime = millis();

    // 게임 패드 진동
    ctl->playDualRumble(0, 300, 0xFF, 0x0);

    // 효과음 3 재생
    myDFPlayer.play(SOUND_MACHINEGUN);
  }

  // L1 버튼으로 볼륨 조절 (둔감하게 처리)
  static bool l1ButtonPressed = false;
  static bool r1ButtonPressed = false;
  static unsigned long l1LastChangeTime = 0;
  static unsigned long r1LastChangeTime = 0;
  constexpr unsigned long volumeChangeInterval = 100;  // 100ms 간격으로 볼륨 변경

  // L1 버튼으로 볼륨 감소 (Y 버튼이 눌리지 않았을 때만)
  if (ctl->l1() && !ctl->y()) {
    if (!l1ButtonPressed) {
      l1ButtonPressed = true;
      tempVolume = currentVolume;  // 현재 볼륨을 임시 볼륨으로 복사
      l1LastChangeTime = millis();
    }

    // 볼륨 감소 (1-30 범위)
    if (tempVolume > 1 &&
        (millis() - l1LastChangeTime >= volumeChangeInterval)) {
      tempVolume--;
      l1LastChangeTime = millis();
      ESP_LOGI(MAIN_TAG, "Volume decreased to: %d", tempVolume);
    }
  } else if (!ctl->l1()) {  // L1 버튼 해제 시에만 처리
    if (l1ButtonPressed) {
      l1ButtonPressed = false;
      // L1 버튼을 뗐을 때 볼륨 변경사항 저장
      if (tempVolume != currentVolume) {
        currentVolume = constrain(tempVolume, 10, 30);
        myDFPlayer.volume(currentVolume);  // DFPlayer 볼륨 적용
        volumeChanged = true;
        ESP_LOGI(MAIN_TAG, "Volume change confirmed: %d", currentVolume);
      }
    }
  }

  // R1 버튼으로 볼륨 증가 (Y 버튼이 눌리지 않았을 때만)
  if (ctl->r1() && !ctl->y()) {
    if (!r1ButtonPressed) {
      r1ButtonPressed = true;
      tempVolume = currentVolume;  // 현재 볼륨을 임시 볼륨으로 복사
      r1LastChangeTime = millis();
    }

    // 볼륨 증가 (1-30 범위)
    if (tempVolume < 30 &&
        (millis() - r1LastChangeTime >= volumeChangeInterval)) {
      tempVolume++;
      r1LastChangeTime = millis();
      ESP_LOGI(MAIN_TAG, "Volume increased to: %d", tempVolume);
    }
  } else if (!ctl->r1()) {  // R1 버튼 해제 시에만 처리
    if (r1ButtonPressed) {
      r1ButtonPressed = false;
      // R1 버튼을 뗐을 때 볼륨 변경사항 저장
      if (tempVolume != currentVolume) {
        currentVolume = constrain(tempVolume, 10, 30);
        myDFPlayer.volume(currentVolume);  // DFPlayer 볼륨 적용
        volumeChanged = true;
        ESP_LOGI(MAIN_TAG, "Volume change confirmed: %d", currentVolume);
      }
    }
  }

  // 볼륨이 변경되었으면 EEPROM에 저장
  if (volumeChanged) {
    saveVolumeSettings();
    volumeChanged = false;
  }

  // 헤드라이트 제어 관련 변수
  static bool yButtonPressed = false;
  static unsigned long lastBrightnessChangeTime = 0;
  constexpr unsigned long brightnessChangeInterval = 200;  // 밝기 변경 간격

  // Y 버튼 처리 (밝기 조절 및 토글)
  if (ctl->y()) {
    // 1. 밝기 조절 (L1/R1과 조합)
    if (ctl->l1() || ctl->r1()) {
      if (millis() - lastBrightnessChangeTime >= brightnessChangeInterval) {
        if (ctl->l1()) {
          headlightDuty = constrain(headlightDuty - HEADLIGHT_DUTY_STEP, HEADLIGHT_DUTY_MIN, HEADLIGHT_DUTY_MAX);
          ESP_LOGI(MAIN_TAG, "Headlight Brightness Decreased: %d", headlightDuty);
        }
        if (ctl->r1()) {
          headlightDuty = constrain(headlightDuty + HEADLIGHT_DUTY_STEP, HEADLIGHT_DUTY_MIN, HEADLIGHT_DUTY_MAX);
          ESP_LOGI(MAIN_TAG, "Headlight Brightness Increased: %d", headlightDuty);
        }
        // 현재 켜져있다면 즉시 적용
        if (headlightOn) {
          ledcWrite(HEADLIGHT_PWM_CHANNEL, headlightDuty);
        }
        lastBrightnessChangeTime = millis();
      }
      // 밝기 조절 중에는 토글 방지를 위해 pressed 상태 유지
      yButtonPressed = true;
    }
    // 2. 헤드라이트 토글 (단독 누름, 최초 눌림 시점)
    else if (!yButtonPressed) {
      yButtonPressed = true;
      headlightOn = !headlightOn;
      if (headlightOn && headlightDuty < HEADLIGHT_DUTY_MIN)
        headlightDuty = HEADLIGHT_DUTY_MIN;
      ledcWrite(HEADLIGHT_PWM_CHANNEL, headlightOn ? headlightDuty : HEADLIGHT_DUTY_OFF);
      ESP_LOGI(MAIN_TAG, "Headlight is %s (Duty: %d)", headlightOn ? "On" : "Off", headlightDuty);
    }
  } else {
    yButtonPressed = false;
  }

  // Select + Start 버튼 3초 이상 동시 누름으로 EEPROM 초기화 및 재시작
  static bool selectStartPressed = false;
  static unsigned long selectStartStartTime = 0;

  if (ctl->miscSelect() && ctl->miscStart()) {
    if (!selectStartPressed) {
      selectStartPressed = true;
      selectStartStartTime = millis();
      ESP_LOGI(MAIN_TAG, "Select + Start 버튼이 눌렸습니다. 3초간 유지하면 EEPROM 초기화가 시작됩니다.");
    } else {
      constexpr unsigned long selectStartHoldDuration = 3000;
      // 버튼이 계속 눌려있는 상태에서 3초 경과 확인
      if (millis() - selectStartStartTime >= selectStartHoldDuration) {
        ESP_LOGI(MAIN_TAG, "Select + Start 버튼을 3초간 누르셨습니다. EEPROM 초기화를 시작합니다.");

        // 게임패드 진동으로 확인 신호
        ctl->playDualRumble(0, 800, 0xFF, 0x0);

        // EEPROM 초기화 및 재시작
        resetEEPROMAndRestart();
      }
    }
  } else {
    selectStartPressed = false;
  }
}

// 포신 발사 처리
void processCannonFiring() {
  if (cannonFiring) {
    const unsigned long currentTime = millis();

    if (currentTime - cannonStartTime >= cannonDuration) {
      // 포신 발사 완료 (쿨타임 종료)
      cannonFiring = false;

      // 효과음 1 재생 재개 (게임패드가 연결되어 있지 않은 경우)
      if (!gamepadConnected && !machineGunFiring) {
        myDFPlayer.play(SOUND_IDLE);
        lastIdleSoundTime = millis();
      }
    }
  }
}

// 기관총 발사 처리
void processMachineGunFiring() {
  if (machineGunFiring) {
    const unsigned long currentTime = millis();
    if (currentTime - machineGunStartTime >= machineGunDuration) {
      // 기관총 발사 완료
      machineGunFiring = false;

      // 효과음 1 재생 재개 (게임패드가 연결되어 있지 않은 경우)
      if (!gamepadConnected && !cannonFiring) {
        myDFPlayer.play(SOUND_IDLE);
        lastIdleSoundTime = millis();
      }
    }
  }
}

// 효과음 반복 재생 처리
void processIdleSound() {
  if (!gamepadConnected && !cannonFiring && !machineGunFiring) {
    const unsigned long currentTime = millis();
    if (currentTime - lastIdleSoundTime >= idleSoundInterval) {
      myDFPlayer.play(SOUND_IDLE);
      lastIdleSoundTime = currentTime;
    }
  }
}

// 모든 컨트롤러 처리
void processControllers() {
  for (const auto myController : myControllers) {
    if (myController && myController->isConnected() &&
        myController->hasData()) {
      if (myController->isGamepad()) {
        processGamepad(myController);
      }
    }
  }
}

// 설정 함수
void setup() {
  ESP_LOGI(MAIN_TAG, "RC Tank Initialization...");

#ifdef DISABLE_BROWNOUT_DETECTOR
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0);  // Disable Brownout Detector
#endif

